Repository: julien-tanguy/easyMaintenace_flutter
Catalog: lib/l10n/intl_*.arb
Languages: fr

# homeTitle
source: Home
fr: Accueil

# addTitle
source: Add vehicle
fr: Ajouter un véhicule

source: Car
fr: Voiture

source: Bike
fr: Moto

# other
source: Other vehicle
fr: Autre

# homeError
source: Sorry, an error occurred :(
fr: Désolé, Une erreur est survenue :(

# dateFormat
source: yyyy/MM/dd
fr: dd/MM/yyyy

# helperTextModel
source: Enter the model
fr: Saisir le modéle

# hintTextModel
source: Model
fr: Modéle

# errorTextModel
source: Model too short
fr: Modéle trop court

# helperTextVersion
source: Enter version
fr: Saisir la version

# errorTextVersion
source: Version too short
fr: Version trop courte

# helperTextNextRevisionDate
source: Enter the date of the next service
fr: Saisir la date de la prochaine révision

# hintTextNextRevisionDate
source: Date of the next service
fr: Date de la prochaine révision

# errorTextNextRevisionDate
source: Date of the next service too short
fr: Date de la prochaine révision trop courte

# helperTextNextRevisionDistance
source: Enter the mileage of the next service
fr: Saisir le kilométrage de la prochaine révision

# hintTextNextRevisionDistance
source: Mileage of the next service
fr: Kilométrage de la prochaine révision

# errorTextNextRevisionDistance
source: Mileage of the next service too short
fr: Kilométrage de la prochaine révision trop courte

# helperTextFrontTire
source: Enter the front tire pressure
fr: Saisir la pression des pneus avants

# hintTextFrontTire
source: Front tire pressure
fr: Pression des pneus avants

# errorTextFrontTireShort
source: Front tire pressure too short
fr: Pression des pneus avants trop courte

# errorTextFrontTireNotDouble
source: Do not use commas, use this format: 2.2
fr: N'utilisez pas de virgules, utilisez ce format : 2.2

# helperTextRearTire
source: Enter the rear tire pressure
fr: Saisir la pression des pneus arriéres

# hintTextRearTire
source: Rear tire pressure
fr: Pression des pneus arriéres

# errorTextRearTireShort
source: Rear tire pressure too short
fr: Pression des pneus arriéres trop courte

# errorTextRearTireNotDouble
source: Do not use commas, use this format: 2.2
fr: N'utilisez pas de virgules, utilisez ce format : 2.2

# helperTextNextTechnicalControlDate
source: Enter the date of the next technical control
fr: Saisir la date du prochain controle technique

# hintTextNextTechnicalControlDate
source: Date of the next technical control
fr: Prochain controle technique

# errorTextNextTechnicalControlDate
source: Date of the next technical control too short
fr: Date du prochain controle technique trop courte

# helperTextFuel
source: Saisir the fuel
fr: Saisir le carburant

# hintTextFuel
source: Fuel
fr: Carburant

# errorTextFuel
source: Fuel too short
fr: Saisie carburant trop courte

# helperTextFreeInformations
source: Enter additional information
fr: Saisir informations complementaires

# hintTextFreeInformations
source: Additional information
fr: Informations complementaires

# errorTextFreeInformations
source: Additional information too short
fr: Informations complementaires trop courtes

# emptyTextFreeInformations
source: No additional information.
fr: Pas d'informations complémentaires.

# tooltipFormValidate
source: Register
fr: Enregistrer

# editVehicle
source: Edit
fr: Modifier

# deleteVehicle
source: Delete
fr: Supprimer

source: Vehicle save
fr: Véhicule enregistrer

# vehicleUpdate
source: Saved changes
fr: Modifications enregistrées

# registerNewVehicle
source: Register a new vehicle
fr: Enregistrer un autre véhicule

source: Back to home
fr: Retour a l'acceuil

# alertTitlePage
source: Your upcoming deadlines
fr: Vos échéances à venir

source: Technical control
fr: Contrôles techniques

# ctIsEmpty
source: All your technical checks are up to date
fr: Tous vos contrôles techniques sont à jour

# revision
source: Revisions
fr: Révisions

# revisionIsEmpty
source: All your revisions are up to date
fr: Toutes vos révisions sont à jour

# subtitleCtTile
source: Technical control to be done :
fr: Contrôle technique à faire le :

# subtitleRevisionTile
source: Upcoming review deadline :
fr: Échéance de révision à venir :

# titleListVehicleHomeIsEmpty
source: No vehicle
fr: Aucun véhicule

# subTitleListVehicleHomeIsEmpty
source: To start, press +
fr: Pour commencer, appuyez sur +
